* add an =s= entry in to =~/.ssh/config=

To be able to ~ssh~ into the server using a single letter such as =s=,
let's add an entry to file:../dotfiles/ssh/config

#+name: ip-address
138.199.149.211

#+name: add-hetzner-ssh-config
#+begin_src fish :results output :var ip=ip-address
echo -e '\nHost hetzner\nHostName '$ip'User root\nIdentityFile ~/.ssh/id_ed25519_ext' >> ~/.ssh/config
tail ~/.ssh/config
#+end_src

#+RESULTS: add-hetzner-ssh-config
#+begin_example
Host gh
HostName github.com
User git
IdentityFile ~/.ssh/id_ed25519_ext


Host hetzner
HostName 138.199.149.211
User root
IdentityFile ~/.ssh/id_ed25519_ext
#+end_example

* remove the =s= entry from =~/.ssh/config=

When we're done, lets clean up.

#+name: remove-hetzner-ssh-config
#+begin_src fish :results output
set -l config ~/dev/my/dotfiles/ssh/config

set -l total_lines (wc -l < $config)
set -l lines_to_keep (math $total_lines - 5)

head -n $lines_to_keep $config > $config'.txt'

mv $config'.txt' $config

tail $config
#+end_src

#+RESULTS: remove-s-ssh-config
#+begin_example
Host ec2
HostName 52.59.177.214
User ec2-user
IdentityFile ~/.ssh/id_rsa_ext

Host gh
HostName github.com
User git
IdentityFile ~/.ssh/id_ed25519_ext

#+end_example

* update the disk device ID

Volume labels can switch around during reboot and cause the system to try to boot from the wrong disk.
For this reason, we want to use the id (from /dev/disk/by-id) of the first ~disk~.
(see also https://joinemm.dev/blog/nixos-hetzner-cloud for more details)

#+name: get-disk-id
#+begin_src bash :results output :dir /ssh:hetzner:

DISK=$(lsblk -nl | awk '$6=="disk" {print $1}' | head -1)
ls -l /dev/disk/by-id/* | grep "../../${DISK}$" | awk '{print $9}' | xargs basename | tr -d '[:space:]'

#+end_src

#+RESULTS: get-disk-id
: scsi-0QEMU_QEMU_HARDDISK_56766495

** update =disk-config.nix=

#+BEGIN_SRC fish :results file link :file disk-config.nix :var ID=get-disk-id
sed -i .bak 's|device = "/dev/disk/by-id/[^"]*"|device = "/dev/disk/by-id/'$ID'"|' disk-config.nix
#+END_SRC

#+RESULTS:
[[file:disk-config.nix]]

** Detailed explanation on obtaining the disk ID

List block devices.

#+name: list-block-devices
#+begin_src bash :results table :dir /ssh:hetzner:

lsblk -nl

#+end_src

#+RESULTS: list-block-devices
| sda       |   8:0 | 0 | 38.1G | 0 | disk |            |
| sda1      |   8:1 | 0 | 1M    | 0 | part |            |
| sda2      |   8:2 | 0 | 500M  | 0 | part | /boot      |
| sda3      |   8:3 | 0 | 37.7G | 0 | part |            |
| sr0       |  11:0 | 1 | 1024M | 0 | rom  |            |
| pool-root | 254:0 | 0 | 37.7G | 0 | lvm  | /nix/store |

Look for lines where the 6th field equals "disk" and, for those lines, print the 1st field.

#+name: disk-block-device-name
#+begin_src bash :results output :dir /ssh:hetzner:

lsblk -nl | awk '$6=="disk" {print $1}' | head -1

#+end_src

#+RESULTS: disk-block-device-name
: sda

List device IDs.

#+name: list-device-ids
#+begin_src bash :results table :dir /ssh:hetzner:

ls -l /dev/disk/by-id/* | awk '{print $9, $10, $11}'

#+end_src

#+RESULTS: list-device-ids
| /dev/disk/by-id/ata-QEMU_DVD-ROM_QM00001                                                     | -> | ../../sr0  |
| /dev/disk/by-id/dm-name-pool-root                                                            | -> | ../../dm-0 |
| /dev/disk/by-id/dm-uuid-LVM-kuuuACyCQy4wwedPSIOrLlJcwbjhasLZFZaCEXWejh5xve28SnLOl1zeryR8PVEN | -> | ../../dm-0 |
| /dev/disk/by-id/lvm-pv-uuid-GuIliJ-GX8p-H5Oq-5NLT-yMtW-vdtA-Cne0Jh                           | -> | ../../sda3 |
| /dev/disk/by-id/scsi-0QEMU_QEMU_HARDDISK_56766495                                            | -> | ../../sda  |
| /dev/disk/by-id/scsi-0QEMU_QEMU_HARDDISK_56766495-part1                                      | -> | ../../sda1 |
| /dev/disk/by-id/scsi-0QEMU_QEMU_HARDDISK_56766495-part2                                      | -> | ../../sda2 |
| /dev/disk/by-id/scsi-0QEMU_QEMU_HARDDISK_56766495-part3                                      | -> | ../../sda3 |

And finally, the disk ID

#+name: disk-device-id
#+begin_src bash :results output :dir /ssh:hetzner:

DISK=$(lsblk -nl | awk '$6=="disk" {print $1}' | head -1)

ls -l /dev/disk/by-id/* | grep "../../${DISK}$" | awk '{print $9}' | xargs basename | tr -d '[:space:]'

#+end_src

#+RESULTS: disk-device-id
: scsi-0QEMU_QEMU_HARDDISK_56766495


* nixify target

#+begin_src fish :results output :session *flake-updagte* :async yes

git pull -r origin main

log-command --label=nixos-anywhere-flake-update -o -- nix flake update --flake .

git add .
git commit -m "chore: udate flake [nixos-anywhere]"
git push origin main

#+end_src


#+begin_src fish :results value :session *nixifying* :async yes

log-command --label=nixify -o -- nix run github:nix-community/nixos-anywhere -- --build-on-remote --flake .#hetzner-cloud --target-host root@138.199.149.211

#+end_src
